ahtn/keyplus/ports/efm8/efm8/mcu/C8051F700/inc/SI_C8051F700_Register_Enums.h
#define CS0MD1_CS0POL__BMASK                0x40 ///< CS0 Digital Comparator Polarity Select            
#define CS0MD1_CS0POL__SHIFT                0x06 ///< CS0 Digital Comparator Polarity Select            
#define CS0MD1_CS0POL__GREATER_THAN         0x00 ///< The digital comparator generates an interrupt if  
                                                 ///< the conversion is greater than the threshold.     
#define CS0MD1_CS0POL__LESS_THAN_OR_EQUAL   0x40 ///< The digital comparator generates an interrupt if  
                                                 ///< the conversion is less than or equal to the       
                                                 ///< threshold.                                        
                                                                                                        
//------------------------------------------------------------------------------
// CS0MD2 Enums (Capacitive Sense 0 Mode 2 @ 0xBE)
//------------------------------------------------------------------------------
#define CS0MD2_CS0IA__FMASK           0x07 ///< CS0 Output Current Adjustment                     
#define CS0MD2_CS0IA__SHIFT           0x00 ///< CS0 Output Current Adjustment                     
#define CS0MD2_CS0IA__CURRENT_MODE0   0x00 ///< Full current.                                     
#define CS0MD2_CS0IA__CURRENT_MODE1   0x01 ///< 1/8 current.                                      
#define CS0MD2_CS0IA__CURRENT_MODE2   0x02 ///< 1/4 current.                                      
#define CS0MD2_CS0IA__CURRENT_MODE3   0x03 ///< 3/8 current.                                      
#define CS0MD2_CS0IA__CURRENT_MODE4   0x04 ///< 1/2 current.                                      
#define CS0MD2_CS0IA__CURRENT_MODE5   0x05 ///< 5/8 current.                                      
#define CS0MD2_CS0IA__CURRENT_MODE6   0x06 ///< 3/4 current.                                      
#define CS0MD2_CS0IA__CURRENT_MODE7   0x07 ///< 7/8 current.                                      
                                                                                                  
#define CS0MD2_CS0DT__FMASK           0x38 ///< CS0 Discharge Time                                
#define CS0MD2_CS0DT__SHIFT           0x03 ///< CS0 Discharge Time                                
#define CS0MD2_CS0DT__DISCHARGE_MODE0 0x00 ///< Discharge time is 0.75 us (recommended for most   
                                           ///< switches).                                        
#define CS0MD2_CS0DT__DISCHARGE_MODE1 0x08 ///< Discharge time is 1.0 us.                         
#define CS0MD2_CS0DT__DISCHARGE_MODE2 0x10 ///< Discharge time is 1.2 us.                         
#define CS0MD2_CS0DT__DISCHARGE_MODE3 0x18 ///< Discharge time is 1.5 us.                         
#define CS0MD2_CS0DT__DISCHARGE_MODE4 0x20 ///< Discharge time is 2 us.                           
#define CS0MD2_CS0DT__DISCHARGE_MODE5 0x28 ///< Discharge time is 3 us.                           
#define CS0MD2_CS0DT__DISCHARGE_MODE6 0x30 ///< Discharge time is 6 us.                           
#define CS0MD2_CS0DT__DISCHARGE_MODE7 0x38 ///< Discharge time is 12 us.                          
                                                                                                  
#define CS0MD2_CS0CR__FMASK           0xC0 ///< CS0 Conversion Rate                               
#define CS0MD2_CS0CR__SHIFT           0x06 ///< CS0 Conversion Rate                               
#define CS0MD2_CS0CR__12_BITS         0x00 ///< Conversions last 12 internal CS0 clocks and are 12
                                           ///< bits in length.                                   
#define CS0MD2_CS0CR__13_BITS         0x40 ///< Conversions last 13 internal CS0 clocks and are 13
                                           ///< bits in length.                                   
#define CS0MD2_CS0CR__14_BITS         0x80 ///< Conversions last 14 internal CS0 clocks and are 14
                                           ///< bits in length.                                   
#define CS0MD2_CS0CR__16_BITS         0xC0 ///< Conversions last 16 internal CS0 clocks.and are 16
                                           ///< bits in length.                                   
                                                                                                  
//------------------------------------------------------------------------------
// CS0MX Enums (Capacitive Sense 0 Mux Channel Select @ 0x9C)
//------------------------------------------------------------------------------
#define CS0MX_CS0MX__FMASK        0x3F ///< CS0 Mux Channel Select                 
#define CS0MX_CS0MX__SHIFT        0x00 ///< CS0 Mux Channel Select                 
#define CS0MX_CS0MX__CS0P0        0x00 ///< Select CS0.0.                          
#define CS0MX_CS0MX__CS0P1        0x01 ///< Select CS0.1.                          
#define CS0MX_CS0MX__CS0P2        0x02 ///< Select CS0.2.                          
#define CS0MX_CS0MX__CS0P3        0x03 ///< Select CS0.3.                          
#define CS0MX_CS0MX__CS0P4        0x04 ///< Select CS0.4.                          
#define CS0MX_CS0MX__CS0P5        0x05 ///< Select CS0.5.                          
#define CS0MX_CS0MX__CS0P6        0x06 ///< Select CS0.6.                          
#define CS0MX_CS0MX__CS0P7        0x07 ///< Select CS0.7.                          
#define CS0MX_CS0MX__CS0P8        0x08 ///< Select CS0.8.                          
#define CS0MX_CS0MX__CS0P9        0x09 ///< Select CS0.9.                          
#define CS0MX_CS0MX__CS0P10       0x0A ///< Select CS0.10.                         
#define CS0MX_CS0MX__CS0P11       0x0B ///< Select CS0.11.                         
#define CS0MX_CS0MX__CS0P12       0x0C ///< Select CS0.12.                         
#define CS0MX_CS0MX__CS0P13       0x0D ///< Select CS0.13.                         
#define CS0MX_CS0MX__CS0P14       0x0E ///< Select CS0.14.                         
#define CS0MX_CS0MX__CS0P15       0x0F ///< Select CS0.15.                         
#define CS0MX_CS0MX__CS0P16       0x10 ///< Select CS0.16.                         
#define CS0MX_CS0MX__CS0P17       0x11 ///< Select CS0.17.                         
#define CS0MX_CS0MX__CS0P18       0x12 ///< Select CS0.18.                         
#define CS0MX_CS0MX__CS0P19       0x13 ///< Select CS0.19.                         
#define CS0MX_CS0MX__CS0P20       0x14 ///< Select CS0.20.                         
#define CS0MX_CS0MX__CS0P21       0x15 ///< Select CS0.21.                         
#define CS0MX_CS0MX__CS0P22       0x16 ///< Select CS0.22.                         
#define CS0MX_CS0MX__CS0P23       0x17 ///< Select CS0.23.                         
#define CS0MX_CS0MX__CS0P24       0x18 ///< Select CS0.24.                         
#define CS0MX_CS0MX__CS0P25       0x19 ///< Select CS0.25.                         
#define CS0MX_CS0MX__CS0P26       0x1A ///< Select CS0.26.                         
#define CS0MX_CS0MX__CS0P27       0x1B ///< Select CS0.27.                         
#define CS0MX_CS0MX__CS0P28       0x1C ///< Select CS0.28.                         
#define CS0MX_CS0MX__CS0P29       0x1D ///< Select CS0.29.                         
#define CS0MX_CS0MX__CS0P30       0x1E ///< Select CS0.30.                         
#define CS0MX_CS0MX__CS0P31       0x1F ///< Select CS0.31.                         
#define CS0MX_CS0MX__CS0P32       0x20 ///< Select CS0.32.                         
#define CS0MX_CS0MX__CS0P33       0x21 ///< Select CS0.33.                         
#define CS0MX_CS0MX__CS0P34       0x22 ///< Select CS0.34.                         
#define CS0MX_CS0MX__CS0P35       0x23 ///< Select CS0.35.                         
#define CS0MX_CS0MX__CS0P36       0x24 ///< Select CS0.36.                         
#define CS0MX_CS0MX__CS0P37       0x25 ///< Select CS0.37.                         
                                                                                   
#define CS0MX_CS0UC__BMASK        0x80 ///< CS0 Unconnected                        
#define CS0MX_CS0UC__SHIFT        0x07 ///< CS0 Unconnected                        
#define CS0MX_CS0UC__CONNECTED    0x00 ///< CS0 is connected to the port pins.     
#define CS0MX_CS0UC__DISCONNECTED 0x80 ///< CS0 is disconnected from the port pins.
                                                                                   
//------------------------------------------------------------------------------
// CS0PM Enums (Capacitive Sense 0 Pin Monitor @ 0x9F)
//------------------------------------------------------------------------------
#define CS0PM_CSPMMD__FMASK                 0x03 ///< CS0 Pin Monitor Mode                             
#define CS0PM_CSPMMD__SHIFT                 0x00 ///< CS0 Pin Monitor Mode                             
#define CS0PM_CSPMMD__ALWAYS_RETRY          0x00 ///< Always retry bit cycles on a pin state change.   
#define CS0PM_CSPMMD__RETRY_TWO_TIMES       0x01 ///< Retry up to twice on consecutive bit cycles.     
#define CS0PM_CSPMMD__RETRY_FOUR_TIMES      0x02 ///< Retry up to four times on consecutive bit cycles.
                                                                                                       
#define CS0PM_CP0PM__BMASK                  0x04 ///< CP0 Pin Monitor Enable                           
#define CS0PM_CP0PM__SHIFT                  0x02 ///< CP0 Pin Monitor Enable                           
#define CS0PM_CP0PM__CMP_MONITOR_DISABLED   0x00 ///< Disable monitoring on the CP0 output.            
#define CS0PM_CP0PM__CMP_MONITOR_ENABLED    0x04 ///< Enable monitoring on the CP0 output.             
                                                                                                       
#define CS0PM_PIOPM__BMASK                  0x08 ///< Port I/O Pin Monitor Enable                      
#define CS0PM_PIOPM__SHIFT                  0x03 ///< Port I/O Pin Monitor Enable                      
#define CS0PM_PIOPM__PORT_MONITOR_DISABLED  0x00 ///< Disable monitoring of writes to the port latches.
#define CS0PM_PIOPM__PORT_MONITOR_ENABLED   0x08 ///< Enable monitoring of writes to the port latches. 
                                                                                                       
#define CS0PM_PCAPM__BMASK                  0x10 ///< PCA Pin Monitor Enable                           
#define CS0PM_PCAPM__SHIFT                  0x04 ///< PCA Pin Monitor Enable                           
#define CS0PM_PCAPM__PCA_MONITOR_DISABLED   0x00 ///< Disable monitoring on the PCA output pins.       
#define CS0PM_PCAPM__PCA_MONITOR_ENABLED    0x10 ///< Enable monitoring on the PCA output pins.        
                                                                                                       
#define CS0PM_SMBPM__BMASK                  0x20 ///< SMBus Pin Monitor Enable                         
#define CS0PM_SMBPM__SHIFT                  0x05 ///< SMBus Pin Monitor Enable                         
#define CS0PM_SMBPM__SMBUS_MONITOR_DISABLED 0x00 ///< Disable monitoring on the SMBus pins.            
#define CS0PM_SMBPM__SMBUS_MONITOR_ENABLED  0x20 ///< Enable monitoring on the SMBus pins.             
                                                                                                       
#define CS0PM_SPIPM__BMASK                  0x40 ///< SPI Pin Monitor Enable                           
#define CS0PM_SPIPM__SHIFT                  0x06 ///< SPI Pin Monitor Enable                           
#define CS0PM_SPIPM__SPI_MONITOR_DISABLED   0x00 ///< Disable monitoring on the SPI output pins.       
#define CS0PM_SPIPM__SPI_MONITOR_ENABLED    0x40 ///< Enable monitoring on the SPI output pins.        
                                                                                                       
#define CS0PM_UAPM__BMASK                   0x80 ///< UART Pin Monitor Enable                          
#define CS0PM_UAPM__SHIFT                   0x07 ///< UART Pin Monitor Enable                          
#define CS0PM_UAPM__UART_MONITOR_DISABLED   0x00 ///< Disable monitoring on the UART TX pin.           
#define CS0PM_UAPM__UART_MONITOR_ENABLED    0x80 ///< Enable monitoring on the UART TX pin.            
                                                                                                       
//------------------------------------------------------------------------------
// CS0SE Enums (Capacitive Sense 0 Auto Scan End Channel @ 0x93)
//------------------------------------------------------------------------------
#define CS0SE_CS0SE__FMASK 0x1F ///< Ending Channel for Auto Scan
#define CS0SE_CS0SE__SHIFT 0x00 ///< Ending Channel for Auto Scan
                                                                 
//------------------------------------------------------------------------------
// CS0SS Enums (Capacitive Sense 0 Auto Scan Start Channel @ 0x92)
//------------------------------------------------------------------------------
#define CS0SS_CS0SS__FMASK 0x1F ///< Starting Channel for Auto Scan
#define CS0SS_CS0SS__SHIFT 0x00 ///< Starting Channel for Auto Scan
                                                                   
//------------------------------------------------------------------------------
// CS0THH Enums (Capacitive Sense 0 Comparator Threshold High Byte @ 0x97)
//------------------------------------------------------------------------------
#define CS0THH_CS0THH__FMASK 0xFF ///< CS0 Comparator Threshold High Byte
#define CS0THH_CS0THH__SHIFT 0x00 ///< CS0 Comparator Threshold High Byte
                                                                         
//------------------------------------------------------------------------------
// CS0THL Enums (Capacitive Sense 0 Comparator Threshold Low Byte @ 0x96)
//------------------------------------------------------------------------------
#define CS0THL_CS0THL__FMASK 0xFF ///< CS0 Comparator Threshold Low Byte
#define CS0THL_CS0THL__SHIFT 0x00 ///< CS0 Comparator Threshold Low Byte
                                                                        
//------------------------------------------------------------------------------
// DERIVID Enums (Derivative Identification @ 0xEC)
//------------------------------------------------------------------------------
#define DERIVID_DERIVID__FMASK        0xFF ///< Derivative ID
#define DERIVID_DERIVID__SHIFT        0x00 ///< Derivative ID
#define DERIVID_DERIVID__C8051F700    0xD0 ///< C8051F700    
#define DERIVID_DERIVID__C8051F701    0xD1 ///< C8051F701    
#define DERIVID_DERIVID__C8051F702    0xD2 ///< C8051F702    
#define DERIVID_DERIVID__C8051F703    0xD3 ///< C8051F703    
#define DERIVID_DERIVID__C8051F704    0xD4 ///< C8051F704    
#define DERIVID_DERIVID__C8051F705    0xD5 ///< C8051F705    
#define DERIVID_DERIVID__C8051F706    0xD6 ///< C8051F706    
#define DERIVID_DERIVID__C8051F707    0xD7 ///< C8051F707    
#define DERIVID_DERIVID__C8051F708    0xD8 ///< C8051F708    
#define DERIVID_DERIVID__C8051F709    0xD9 ///< C8051F709    
#define DERIVID_DERIVID__C8051F710    0xDA ///< C8051F710    
#define DERIVID_DERIVID__C8051F711    0xDB ///< C8051F711    
#define DERIVID_DERIVID__C8051F712    0xDC ///< C8051F712    
#define DERIVID_DERIVID__C8051F713    0xDD ///< C8051F713    
#define DERIVID_DERIVID__C8051F714    0xDE ///< C8051F714    
#define DERIVID_DERIVID__C8051F715    0xDF ///< C8051F715    
#define DERIVID_DERIVID__C8051F716    0xE0 ///< C8051F716    
#define DERIVID_DERIVID__C8051F717    0xE1 ///< C8051F717    
#define DERIVID_DERIVID__C8051F862_GS 0xE2 ///< C8051F862-GS 
#define DERIVID_DERIVID__C8051F863_GS 0xE3 ///< C8051F863-GS 
#define DERIVID_DERIVID__C8051F864_GS 0xE4 ///< C8051F864-GS 
#define DERIVID_DERIVID__C8051F865_GS 0xE5 ///< C8051F865-GS 
#define DERIVID_DERIVID__C8051F850_GM 0xF0 ///< C8051F850-GM 
#define DERIVID_DERIVID__C8051F851_GM 0xF1 ///< C8051F851-GM 
#define DERIVID_DERIVID__C8051F852_GM 0xF2 ///< C8051F852-GM 
#define DERIVID_DERIVID__C8051F853_GM 0xF3 ///< C8051F853-GM 
#define DERIVID_DERIVID__C8051F854_GM 0xF4 ///< C8051F854-GM 
#define DERIVID_DERIVID__C8051F855_GM 0xF5 ///< C8051F855-GM 
                                                             
//------------------------------------------------------------------------------
// DEVICEID Enums (Device Identification @ 0xC4)
//------------------------------------------------------------------------------
#define DEVICEID_DEVICEID__FMASK 0xFF ///< Device ID
#define DEVICEID_DEVICEID__SHIFT 0x00 ///< Device ID
                                                    
//------------------------------------------------------------------------------
// REVID Enums (Revision Identifcation @ 0xAD)
//------------------------------------------------------------------------------
#define REVID_REVID__FMASK 0xFF ///< Revision ID
#define REVID_REVID__SHIFT 0x00 ///< Revision ID
#define REVID_REVID__REV_A 0x00 ///< Revision A 
#define REVID_REVID__REV_B 0x01 ///< Revision B 
#define REVID_REVID__REV_C 0x02 ///< Revision C 
                                                
//------------------------------------------------------------------------------
// EEADR Enums (EEPROM Byte Address @ 0xB6)
//------------------------------------------------------------------------------
#define EEADR_EEADR__FMASK 0x1F ///< EEPROM Byte Address
#define EEADR_EEADR__SHIFT 0x00 ///< EEPROM Byte Address
                                                        
//------------------------------------------------------------------------------
// EECN Enums (EEPROM Control @ 0xC5)
//------------------------------------------------------------------------------
#define EECN_AUTOINC__BMASK    0x01 ///< Auto Increment Enable                            
#define EECN_AUTOINC__SHIFT    0x00 ///< Auto Increment Enable                            
#define EECN_AUTOINC__DISABLED 0x00 ///< Disable auto-increment.                          
#define EECN_AUTOINC__ENABLED  0x01 ///< Enable auto-increment.                           
                                                                                          
#define EECN_EEWRITE__BMASK    0x02 ///< EEPROM 32-Byte Write                             
#define EECN_EEWRITE__SHIFT    0x01 ///< EEPROM 32-Byte Write                             
#define EECN_EEWRITE__COPY     0x02 ///< Copy the 32 bytes of EEPROM RAM into the EEPROM. 
                                                                                          
#define EECN_EEREAD__BMASK     0x04 ///< EEPROM 32-Byte Read                              
#define EECN_EEREAD__SHIFT     0x02 ///< EEPROM 32-Byte Read                              
#define EECN_EEREAD__COPY      0x04 ///< Copy the 32 bytes of the EEPROM into the EEPROM  
                                    ///< RAM.                                             
                                                                                          
#define EECN_EEEN__BMASK       0x80 ///< EEPROM Enable                                    
#define EECN_EEEN__SHIFT       0x07 ///< EEPROM Enable                                    
#define EECN_EEEN__DISABLED    0x00 ///< Disable the EEPROM control logic.                
#define EECN_EEEN__ENABLED     0x80 ///< Enable the EEPROM control logic. EEPROM reads and
                                    ///< writes can be performed.                         
                                                                                          
//------------------------------------------------------------------------------
// EEDAT Enums (EEPROM Byte Data @ 0xD1)
//------------------------------------------------------------------------------
#define EEDAT_EEDAT__FMASK 0xFF ///< EEPROM Data
#define EEDAT_EEDAT__SHIFT 0x00 ///< EEPROM Data
                                                
//------------------------------------------------------------------------------
// EEKEY Enums (EEPROM Key @ 0xC6)
//------------------------------------------------------------------------------
#define EEKEY_EEKEY__FMASK    0xFF ///< EEPROM Key                                      
#define EEKEY_EEKEY__SHIFT    0x00 ///< EEPROM Key                                      
#define EEKEY_EEKEY__LOCKED   0x00 ///< EEPROM writes are not enabled.                  
#define EEKEY_EEKEY__FIRST    0x01 ///< The first key code has been written (0x55).     
#define EEKEY_EEKEY__UNLOCKED 0x02 ///< The EEPROM is unlocked (writes allowed).        
#define EEKEY_EEKEY__DISABLED 0x03 ///< EEPROM writes are disabled until the next reset.
#define EEKEY_EEKEY__KEY1     0x55 ///<                                                 
#define EEKEY_EEKEY__KEY2     0xAA ///<                                                 
                                                                                        
//------------------------------------------------------------------------------
// IT01CF Enums (INT0/INT1 Configuration @ 0xE4)
//------------------------------------------------------------------------------
#define IT01CF_IN0SL__FMASK       0x07 ///< INT0 Port Pin Selection   
#define IT01CF_IN0SL__SHIFT       0x00 ///< INT0 Port Pin Selection   
#define IT01CF_IN0SL__P0_0        0x00 ///< Select P0.0.              
#define IT01CF_IN0SL__P0_1        0x01 ///< Select P0.1.              
#define IT01CF_IN0SL__P0_2        0x02 ///< Select P0.2.              
#define IT01CF_IN0SL__P0_3        0x03 ///< Select P0.3.              
#define IT01CF_IN0SL__P0_4        0x04 ///< Select P0.4.              
#define IT01CF_IN0SL__P0_5        0x05 ///< Select P0.5.              
#define IT01CF_IN0SL__P0_6        0x06 ///< Select P0.6.              
#define IT01CF_IN0SL__P0_7        0x07 ///< Select P0.7.              
                                                                      
