ahtn/keyplus/ports/efm8/efm8/mcu/C8051F700/inc/SI_C8051F700_Register_Enums.h
#define P5DRV_B2__BMASK      0x04 ///< Port 5 Bit 2 Drive Strength                
#define P5DRV_B2__SHIFT      0x02 ///< Port 5 Bit 2 Drive Strength                
#define P5DRV_B2__LOW_DRIVE  0x00 ///< P5.2 output has low output drive strength. 
#define P5DRV_B2__HIGH_DRIVE 0x04 ///< P5.2 output has high output drive strength.
                                                                                  
#define P5DRV_B3__BMASK      0x08 ///< Port 5 Bit 3 Drive Strength                
#define P5DRV_B3__SHIFT      0x03 ///< Port 5 Bit 3 Drive Strength                
#define P5DRV_B3__LOW_DRIVE  0x00 ///< P5.3 output has low output drive strength. 
#define P5DRV_B3__HIGH_DRIVE 0x08 ///< P5.3 output has high output drive strength.
                                                                                  
#define P5DRV_B4__BMASK      0x10 ///< Port 5 Bit 4 Drive Strength                
#define P5DRV_B4__SHIFT      0x04 ///< Port 5 Bit 4 Drive Strength                
#define P5DRV_B4__LOW_DRIVE  0x00 ///< P5.4 output has low output drive strength. 
#define P5DRV_B4__HIGH_DRIVE 0x10 ///< P5.4 output has high output drive strength.
                                                                                  
#define P5DRV_B5__BMASK      0x20 ///< Port 5 Bit 5 Drive Strength                
#define P5DRV_B5__SHIFT      0x05 ///< Port 5 Bit 5 Drive Strength                
#define P5DRV_B5__LOW_DRIVE  0x00 ///< P5.5 output has low output drive strength. 
#define P5DRV_B5__HIGH_DRIVE 0x20 ///< P5.5 output has high output drive strength.
                                                                                  
#define P5DRV_B6__BMASK      0x40 ///< Port 5 Bit 6 Drive Strength                
#define P5DRV_B6__SHIFT      0x06 ///< Port 5 Bit 6 Drive Strength                
#define P5DRV_B6__LOW_DRIVE  0x00 ///< P5.6 output has low output drive strength. 
#define P5DRV_B6__HIGH_DRIVE 0x40 ///< P5.6 output has high output drive strength.
                                                                                  
#define P5DRV_B7__BMASK      0x80 ///< Port 5 Bit 7 Drive Strength                
#define P5DRV_B7__SHIFT      0x07 ///< Port 5 Bit 7 Drive Strength                
#define P5DRV_B7__LOW_DRIVE  0x00 ///< P5.7 output has low output drive strength. 
#define P5DRV_B7__HIGH_DRIVE 0x80 ///< P5.7 output has high output drive strength.
                                                                                  
//------------------------------------------------------------------------------
// P5MDIN Enums (Port 5 Input Mode @ 0xF6)
//------------------------------------------------------------------------------
#define P5MDIN_B0__BMASK   0x01 ///< Port 5 Bit 0 Input Mode                 
#define P5MDIN_B0__SHIFT   0x00 ///< Port 5 Bit 0 Input Mode                 
#define P5MDIN_B0__ANALOG  0x00 ///< P5.0 pin is configured for analog mode. 
#define P5MDIN_B0__DIGITAL 0x01 ///< P5.0 pin is configured for digital mode.
                                                                             
#define P5MDIN_B1__BMASK   0x02 ///< Port 5 Bit 1 Input Mode                 
#define P5MDIN_B1__SHIFT   0x01 ///< Port 5 Bit 1 Input Mode                 
#define P5MDIN_B1__ANALOG  0x00 ///< P5.1 pin is configured for analog mode. 
#define P5MDIN_B1__DIGITAL 0x02 ///< P5.1 pin is configured for digital mode.
                                                                             
#define P5MDIN_B2__BMASK   0x04 ///< Port 5 Bit 2 Input Mode                 
#define P5MDIN_B2__SHIFT   0x02 ///< Port 5 Bit 2 Input Mode                 
#define P5MDIN_B2__ANALOG  0x00 ///< P5.2 pin is configured for analog mode. 
#define P5MDIN_B2__DIGITAL 0x04 ///< P5.2 pin is configured for digital mode.
                                                                             
#define P5MDIN_B3__BMASK   0x08 ///< Port 5 Bit 3 Input Mode                 
#define P5MDIN_B3__SHIFT   0x03 ///< Port 5 Bit 3 Input Mode                 
#define P5MDIN_B3__ANALOG  0x00 ///< P5.3 pin is configured for analog mode. 
#define P5MDIN_B3__DIGITAL 0x08 ///< P5.3 pin is configured for digital mode.
                                                                             
#define P5MDIN_B4__BMASK   0x10 ///< Port 5 Bit 4 Input Mode                 
#define P5MDIN_B4__SHIFT   0x04 ///< Port 5 Bit 4 Input Mode                 
#define P5MDIN_B4__ANALOG  0x00 ///< P5.4 pin is configured for analog mode. 
#define P5MDIN_B4__DIGITAL 0x10 ///< P5.4 pin is configured for digital mode.
                                                                             
#define P5MDIN_B5__BMASK   0x20 ///< Port 5 Bit 5 Input Mode                 
#define P5MDIN_B5__SHIFT   0x05 ///< Port 5 Bit 5 Input Mode                 
#define P5MDIN_B5__ANALOG  0x00 ///< P5.5 pin is configured for analog mode. 
#define P5MDIN_B5__DIGITAL 0x20 ///< P5.5 pin is configured for digital mode.
                                                                             
#define P5MDIN_B6__BMASK   0x40 ///< Port 5 Bit 6 Input Mode                 
#define P5MDIN_B6__SHIFT   0x06 ///< Port 5 Bit 6 Input Mode                 
#define P5MDIN_B6__ANALOG  0x00 ///< P5.6 pin is configured for analog mode. 
#define P5MDIN_B6__DIGITAL 0x40 ///< P5.6 pin is configured for digital mode.
                                                                             
#define P5MDIN_B7__BMASK   0x80 ///< Port 5 Bit 7 Input Mode                 
#define P5MDIN_B7__SHIFT   0x07 ///< Port 5 Bit 7 Input Mode                 
#define P5MDIN_B7__ANALOG  0x00 ///< P5.7 pin is configured for analog mode. 
#define P5MDIN_B7__DIGITAL 0x80 ///< P5.7 pin is configured for digital mode.
                                                                             
//------------------------------------------------------------------------------
// P5MDOUT Enums (Port 5 Output Mode @ 0x9B)
//------------------------------------------------------------------------------
#define P5MDOUT_B0__BMASK      0x01 ///< Port 5 Bit 0 Output Mode  
#define P5MDOUT_B0__SHIFT      0x00 ///< Port 5 Bit 0 Output Mode  
#define P5MDOUT_B0__OPEN_DRAIN 0x00 ///< P5.0 output is open-drain.
#define P5MDOUT_B0__PUSH_PULL  0x01 ///< P5.0 output is push-pull. 
                                                                   
#define P5MDOUT_B1__BMASK      0x02 ///< Port 5 Bit 1 Output Mode  
#define P5MDOUT_B1__SHIFT      0x01 ///< Port 5 Bit 1 Output Mode  
#define P5MDOUT_B1__OPEN_DRAIN 0x00 ///< P5.1 output is open-drain.
#define P5MDOUT_B1__PUSH_PULL  0x02 ///< P5.1 output is push-pull. 
                                                                   
#define P5MDOUT_B2__BMASK      0x04 ///< Port 5 Bit 2 Output Mode  
#define P5MDOUT_B2__SHIFT      0x02 ///< Port 5 Bit 2 Output Mode  
#define P5MDOUT_B2__OPEN_DRAIN 0x00 ///< P5.2 output is open-drain.
#define P5MDOUT_B2__PUSH_PULL  0x04 ///< P5.2 output is push-pull. 
                                                                   
#define P5MDOUT_B3__BMASK      0x08 ///< Port 5 Bit 3 Output Mode  
#define P5MDOUT_B3__SHIFT      0x03 ///< Port 5 Bit 3 Output Mode  
#define P5MDOUT_B3__OPEN_DRAIN 0x00 ///< P5.3 output is open-drain.
#define P5MDOUT_B3__PUSH_PULL  0x08 ///< P5.3 output is push-pull. 
                                                                   
