ahtn/keyplus/ports/efm8/efm8/mcu/C8051F700/inc/SI_C8051F700_Register_Enums.h
#define P5MDOUT_B4__BMASK      0x10 ///< Port 5 Bit 4 Output Mode  
#define P5MDOUT_B4__SHIFT      0x04 ///< Port 5 Bit 4 Output Mode  
#define P5MDOUT_B4__OPEN_DRAIN 0x00 ///< P5.4 output is open-drain.
#define P5MDOUT_B4__PUSH_PULL  0x10 ///< P5.4 output is push-pull. 
                                                                   
#define P5MDOUT_B5__BMASK      0x20 ///< Port 5 Bit 5 Output Mode  
#define P5MDOUT_B5__SHIFT      0x05 ///< Port 5 Bit 5 Output Mode  
#define P5MDOUT_B5__OPEN_DRAIN 0x00 ///< P5.5 output is open-drain.
#define P5MDOUT_B5__PUSH_PULL  0x20 ///< P5.5 output is push-pull. 
                                                                   
#define P5MDOUT_B6__BMASK      0x40 ///< Port 5 Bit 6 Output Mode  
#define P5MDOUT_B6__SHIFT      0x06 ///< Port 5 Bit 6 Output Mode  
#define P5MDOUT_B6__OPEN_DRAIN 0x00 ///< P5.6 output is open-drain.
#define P5MDOUT_B6__PUSH_PULL  0x40 ///< P5.6 output is push-pull. 
                                                                   
#define P5MDOUT_B7__BMASK      0x80 ///< Port 5 Bit 7 Output Mode  
#define P5MDOUT_B7__SHIFT      0x07 ///< Port 5 Bit 7 Output Mode  
#define P5MDOUT_B7__OPEN_DRAIN 0x00 ///< P5.7 output is open-drain.
#define P5MDOUT_B7__PUSH_PULL  0x80 ///< P5.7 output is push-pull. 
                                                                   
//------------------------------------------------------------------------------
// P6 Enums (Port 6 Pin Latch @ 0xB2)
//------------------------------------------------------------------------------
#define P6_B0__BMASK 0x01 ///< Port 6 Bit 0 Latch                            
#define P6_B0__SHIFT 0x00 ///< Port 6 Bit 0 Latch                            
#define P6_B0__LOW   0x00 ///< P6.0 is low. Set P6.0 to drive low.           
#define P6_B0__HIGH  0x01 ///< P6.0 is high. Set P6.0 to drive or float high.
                                                                             
#define P6_B1__BMASK 0x02 ///< Port 6 Bit 1 Latch                            
#define P6_B1__SHIFT 0x01 ///< Port 6 Bit 1 Latch                            
#define P6_B1__LOW   0x00 ///< P6.1 is low. Set P6.1 to drive low.           
#define P6_B1__HIGH  0x02 ///< P6.1 is high. Set P6.1 to drive or float high.
                                                                             
#define P6_B2__BMASK 0x04 ///< Port 6 Bit 2 Latch                            
#define P6_B2__SHIFT 0x02 ///< Port 6 Bit 2 Latch                            
#define P6_B2__LOW   0x00 ///< P6.2 is low. Set P6.2 to drive low.           
#define P6_B2__HIGH  0x04 ///< P6.2 is high. Set P6.2 to drive or float high.
                                                                             
#define P6_B3__BMASK 0x08 ///< Port 6 Bit 3 Latch                            
#define P6_B3__SHIFT 0x03 ///< Port 6 Bit 3 Latch                            
#define P6_B3__LOW   0x00 ///< P6.3 is low. Set P6.3 to drive low.           
#define P6_B3__HIGH  0x08 ///< P6.3 is high. Set P6.3 to drive or float high.
                                                                             
#define P6_B4__BMASK 0x10 ///< Port 6 Bit 4 Latch                            
#define P6_B4__SHIFT 0x04 ///< Port 6 Bit 4 Latch                            
#define P6_B4__LOW   0x00 ///< P6.4 is low. Set P6.4 to drive low.           
#define P6_B4__HIGH  0x10 ///< P6.4 is high. Set P6.4 to drive or float high.
                                                                             
#define P6_B5__BMASK 0x20 ///< Port 6 Bit 5 Latch                            
#define P6_B5__SHIFT 0x05 ///< Port 6 Bit 5 Latch                            
#define P6_B5__LOW   0x00 ///< P6.5 is low. Set P6.5 to drive low.           
#define P6_B5__HIGH  0x20 ///< P6.5 is high. Set P6.5 to drive or float high.
                                                                             
//------------------------------------------------------------------------------
// P6DRV Enums (Port 6 Drive Strength @ 0xC1)
//------------------------------------------------------------------------------
#define P6DRV_B0__BMASK      0x01 ///< Port 6 Bit 0 Drive Strength                
#define P6DRV_B0__SHIFT      0x00 ///< Port 6 Bit 0 Drive Strength                
#define P6DRV_B0__LOW_DRIVE  0x00 ///< P6.0 output has low output drive strength. 
#define P6DRV_B0__HIGH_DRIVE 0x01 ///< P6.0 output has high output drive strength.
                                                                                  
#define P6DRV_B1__BMASK      0x02 ///< Port 6 Bit 1 Drive Strength                
#define P6DRV_B1__SHIFT      0x01 ///< Port 6 Bit 1 Drive Strength                
#define P6DRV_B1__LOW_DRIVE  0x00 ///< P6.1 output has low output drive strength. 
#define P6DRV_B1__HIGH_DRIVE 0x02 ///< P6.1 output has high output drive strength.
                                                                                  
#define P6DRV_B2__BMASK      0x04 ///< Port 6 Bit 2 Drive Strength                
#define P6DRV_B2__SHIFT      0x02 ///< Port 6 Bit 2 Drive Strength                
#define P6DRV_B2__LOW_DRIVE  0x00 ///< P6.2 output has low output drive strength. 
#define P6DRV_B2__HIGH_DRIVE 0x04 ///< P6.2 output has high output drive strength.
                                                                                  
#define P6DRV_B3__BMASK      0x08 ///< Port 6 Bit 3 Drive Strength                
#define P6DRV_B3__SHIFT      0x03 ///< Port 6 Bit 3 Drive Strength                
#define P6DRV_B3__LOW_DRIVE  0x00 ///< P6.3 output has low output drive strength. 
#define P6DRV_B3__HIGH_DRIVE 0x08 ///< P6.3 output has high output drive strength.
                                                                                  
#define P6DRV_B4__BMASK      0x10 ///< Port 6 Bit 4 Drive Strength                
#define P6DRV_B4__SHIFT      0x04 ///< Port 6 Bit 4 Drive Strength                
#define P6DRV_B4__LOW_DRIVE  0x00 ///< P6.4 output has low output drive strength. 
#define P6DRV_B4__HIGH_DRIVE 0x10 ///< P6.4 output has high output drive strength.
                                                                                  
#define P6DRV_B5__BMASK      0x20 ///< Port 6 Bit 5 Drive Strength                
#define P6DRV_B5__SHIFT      0x05 ///< Port 6 Bit 5 Drive Strength                
#define P6DRV_B5__LOW_DRIVE  0x00 ///< P6.5 output has low output drive strength. 
#define P6DRV_B5__HIGH_DRIVE 0x20 ///< P6.5 output has high output drive strength.
                                                                                  
//------------------------------------------------------------------------------
// P6MDIN Enums (Port 6 Input Mode @ 0xF7)
//------------------------------------------------------------------------------
#define P6MDIN_B0__BMASK   0x01 ///< Port 6 Bit 0 Input Mode                 
#define P6MDIN_B0__SHIFT   0x00 ///< Port 6 Bit 0 Input Mode                 
#define P6MDIN_B0__ANALOG  0x00 ///< P6.0 pin is configured for analog mode. 
#define P6MDIN_B0__DIGITAL 0x01 ///< P6.0 pin is configured for digital mode.
                                                                             
#define P6MDIN_B1__BMASK   0x02 ///< Port 6 Bit 1 Input Mode                 
#define P6MDIN_B1__SHIFT   0x01 ///< Port 6 Bit 1 Input Mode                 
#define P6MDIN_B1__ANALOG  0x00 ///< P6.1 pin is configured for analog mode. 
#define P6MDIN_B1__DIGITAL 0x02 ///< P6.1 pin is configured for digital mode.
                                                                             
#define P6MDIN_B2__BMASK   0x04 ///< Port 6 Bit 2 Input Mode                 
#define P6MDIN_B2__SHIFT   0x02 ///< Port 6 Bit 2 Input Mode                 
#define P6MDIN_B2__ANALOG  0x00 ///< P6.2 pin is configured for analog mode. 
#define P6MDIN_B2__DIGITAL 0x04 ///< P6.2 pin is configured for digital mode.
                                                                             
#define P6MDIN_B3__BMASK   0x08 ///< Port 6 Bit 3 Input Mode                 
#define P6MDIN_B3__SHIFT   0x03 ///< Port 6 Bit 3 Input Mode                 
#define P6MDIN_B3__ANALOG  0x00 ///< P6.3 pin is configured for analog mode. 
#define P6MDIN_B3__DIGITAL 0x08 ///< P6.3 pin is configured for digital mode.
                                                                             
#define P6MDIN_B4__BMASK   0x10 ///< Port 6 Bit 4 Input Mode                 
#define P6MDIN_B4__SHIFT   0x04 ///< Port 6 Bit 4 Input Mode                 
#define P6MDIN_B4__ANALOG  0x00 ///< P6.4 pin is configured for analog mode. 
#define P6MDIN_B4__DIGITAL 0x10 ///< P6.4 pin is configured for digital mode.
                                                                             
